onlhon/stm32rtospet/User/main.c
#include "stm32f10x.h"                  // Device header
#include "Servo.h"
#include "Control.h"
#include "PetAction.h"
#include "OLED.h"
#include "Led.h"

#include "Face_Config.h"

//Freertos头文件
#include "FreeRTOS.h"
#include "task.h"

TaskHandle_t StartTaskHandle;
TaskHandle_t ActionTaskHandle;
TaskHandle_t OLEDTaskHandle;

void StartTask(void *pvParameters);
void ActionTask(void *pvParameters);
void OLEDTask(void *pvParameters);

void ActionTask(void *pvParameters)
{
	while(1)
	{
		if(Action_Mode==0){Action_relaxed_getdowm();WServo_Angle(90);}//放松趴下
		else if(Action_Mode==1){Action_sit();}//坐下
		else if(Action_Mode==2){Action_upright();}//站立
		else if(Action_Mode==3){Action_getdowm();}//趴下
		else if(Action_Mode==4){Action_advance();}//前进
		else if(Action_Mode==5){Action_back();}//后退
		else if(Action_Mode==6){Action_Lrotation();}//左转
		else if(Action_Mode==7){Action_Rrotation();}//右转
		else if(Action_Mode==8){Action_Swing();}//摇摆
		else if(Action_Mode==9){Action_SwingTail();}//摇尾巴
		else if(Action_Mode==10){Action_JumpU();}//前跳
		else if(Action_Mode==11){Action_JumpD();}//后跳
		else if(Action_Mode==12){Action_upright2();}//站立方式2
		else if(Action_Mode==13){Action_Hello();}//打招呼
		vTaskDelay(100 / portTICK_RATE_MS);
	}
}

void OLEDTask(void *pvParameters)
{
	while(1)
	{
		// OLEDTask 现在接管了屏幕刷新工作，直接调用 Face_Config
		// Face_Config 内部会根据 Control.c 中解析的 Face_Mode 刷新对应图片
		Face_Config(); 
		
		vTaskDelay(200 / portTICK_RATE_MS); // 刷新率，不需要太快
	}
}

void StartTask(void *pvParameters)
{
	taskENTER_CRITICAL(); //进入临界区，禁止中断
	//外设初始化
	ServoInit();
	OLED_Init();//OLED初始化
	Control_Init();//蓝牙初始化
	OLED_ShowImage(0,0,128,64,Face_sleep);
	OLED_Update();
	GPIO_WriteBit(GPIOA, GPIO_Pin_1, Bit_RESET);
	//创建任务
	xTaskCreate(ActionTask, "ActionTask", 128, NULL, 2, &ActionTaskHandle);
	xTaskCreate(OLEDTask, "OLEDTask", 128, NULL, 3, &OLEDTaskHandle);
	vTaskDelete(StartTaskHandle); //删除自己
	taskEXIT_CRITICAL(); //退出临界区，允许中断
}

int main(void)
{
	
	//创建任务
	xTaskCreate(StartTask, "StartTask", 128, NULL, 1, &StartTaskHandle);

	//开启任务调度器
	vTaskStartScheduler();
	
	/* 正常情况下程序不会运行到这里 */
	while(1)
	{	
	}
}




